print('\nДобро пожаловать на тест на сколько ты знаешь компьютерную эндустрию!')
b=0

a = input('\n 1.Компьютер -  это \n а) устройство для поиска, сбора, хранения, преобразования и использования информации в цифровом формате \n б) устройство для хранения информации \n в) совокупность программных средств, осуществляющих управление информационными ресурсами \n Ответ: ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 2.Одно из главных состовных частей компьютера - \n а) блок питания \n б) кнопка питания \n в) задняя панель \n Ответ: ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 3.Монитор предназначен для - \n а) управления работой компьютера по заданной программе \n  б) подключения периферийных устройств к магистрали \n в) изображения текстовой и графической информации \n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input('\n 4.Одно из основных устройств компьютера - \n а) сетевой шнур \n б) память \n в) кнопка питания\n Ответ: ') 
if a == 'б':
	b=b+1
else:
	b=b+0
a = input('\n 5.Если дважды щелкнуть на заполненной ячейке таблицы в программе Excel активируется режим - \n а) копирования содержимого ячейки \n б) ввода данных, если ими является Формульное выражение \n в) редактирования содержимого ячейки \n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input ('\n 6.Исполняемые в текущий момент компьютерные программы размещаются - \n а) на устройствах ввода \n б) на магнитных дисках \n в) во внутренней памяти \n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input('\n 7.Чтобы записать документ программы Word на дискету, надо выбрать пункт меню файл - \n а) Переписать \n б) Записать \n в) Сохранить как…\n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input('\n 8.Устройство, предназначенное для записи,хранения и выдачи данных - \n а) память компьютера \n б) гарантия компьютера \n в) браузер\n Ответ:  ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 9.Открыть доступ к папке на своем компьютере можно с помощью команд - \n а) двойной щелчок на папке – Общий доступ и безопасность – Доступ \n б) щелчок на папке – Общий доступ и безопасность – Доступ \n в) контекстное меню папки – Общий доступ и безопасность – Доступ \n Ответ:  ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input('\n 10.Один из видорв информации,который может обрабатывать современный компьютер - \n а) изображение \n б) вкус \n в) запах\n Ответ: ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 11.С помощью каких можно выполнить поиск компьютера в локальной сети - \n а) Пуск – Поиск – Компьютеры или людей – Компьютер в сети \n б) Пуск – Отыскать – Компьютеры или людей – Компьютер в сети \n в) Пуск – Поиск – Файлы и папки – Компьютер в сети \n Ответ:  ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 12.Один из видов информации,который может обрабатывать современный компьютер -\n а) запах \n б) текст \n в) телепортация \n Ответ: ')
if a == 'б':
	b=b+1
else:
	b=b+0
a = input('\n 13.Просмотреть,какие компьютеры находятся в вашей Рабочей группе, можно с помощью команд - \n а) запах \n б) текст \n в) телепортация\n Ответ:  ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 14.CD-ROM - \n а) устройство для долговременного хранения информации \n б) устройство чтения информации с компакт-диска \n в) устройство для записи информации на магнитный диск\n Ответ: ')
if a == 'б':
	b=b+1
else:
	b=b+0
a = input('\n 15.Антивирусные программы - \n а) программы, выявляющие и лечащие компьютерные вирусы \n б) программы-архиваторы, разархиваторы \n в) программы, только выявляющие вирусы\n Ответ: ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 16.Из каких частей состоит обозначение файла в операционной системе Windows - \n  а) из двух частей: имени и доменного имени \n б) из одной части: имени \n в) из двух частей: имени и расширения\n Ответ: ')
if a == 'а':
	b=b+1
else:
	b=b+0
a = input('\n 17.kакое устройство компьютера моделирует мышление человека - \n а) монитор \n б) оперативная память \n в) процессор \n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input ('\n 18.Что отображает окно Мой компьютер - \n а) количество программ, установленных на компьютере \n б) диск или другой носитель, который не используется пользователем \n в) список дисков и дополнительных устройств хранения информации \n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0
a = input('\n 19.Что является средством хранения редко используемых данных: резервных копий,старых программ,журналов - \n а) буфер \n б) файл \n в) архив\n Ответ: ')
if a == 'в':
	b=b+1
else:
	b=b+0



print('Вы набрали: '+str(b)+' баллов из 19' )
input('Нажмите Enter для завершения программы')